use KidsUp;

INSERT INTO `admin` (`email`, `pwd`, `firstname`, `lastname`, `town`, `streetName`, `streetNumber`, `PostalCode`, `PhoneNumber`, `online`) VALUES
('admin@mail.com', '123', 'Διαχειρηστής', 'Διαχειράκος', 'Κορυδαλλός', 'Ταξιαρχών', 56, 18120, 2105645327, b'1');

INSERT INTO `parent` (`ParEmail`, `pwd`, `firstname`, `lastname`, `town`, `streetName`, `streetNumber`, `PostalCode`, `PhoneNumber`, `latitude`, `longitude`, `Points`, `online`, `activated`, `token`) VALUES
('KidsUp42+mariapapa@gmail.com', '$2y$10$8sx5fL4K7tffDsaYrtnMVuXVmKeOw4KNcbM4jmlP/Ce8hPxgn2ZQW', 'Μαρία', 'Παπά', 'Αθήνα', 'Ιερά Οδός', 43, 11854, 2105912770, '37.98014', '23.71257', 50, b'1', b'1', NULL),
('KidsUp42+pantelism@gmail.com', '$2y$10$n9at.DrwGGi6w/Z52AQo4.NTgG0gA/CKL/iKUhCNIas.J2RpJnfg.', 'Παντελής', 'Μίχας', 'Κηφισιά', 'Πεσμαζόγλου', 22, 14561, 2105674532, '38.07981', '23.80810', 520, b'1', b'1', NULL),
('ndragazis@outlook.com.gr','$2y$10$8sx5fL4K7tffDsaYrtnMVuXVmKeOw4KNcbM4jmlP/Ce8hPxgn2ZQW','Νίκος','Δράγαζης','Μοσχάτο','Πατρών',4,18345,6984389408,37.954512,23.681912,300,b'1', b'1', NULL),
('mike95gr@hotmail.com','$2y$10$8sx5fL4K7tffDsaYrtnMVuXVmKeOw4KNcbM4jmlP/Ce8hPxgn2ZQW','Μιχάλης','Καραμουσαδάκης','Άργους','Αθήνα',104,10441,2103267849,37.989083,23.710793,130,b'1', b'1', NULL),
('karakosg@hotmail.gr','$2y$10$8sx5fL4K7tffDsaYrtnMVuXVmKeOw4KNcbM4jmlP/Ce8hPxgn2ZQW','Γιώργος','Καράκος','Τραπεζούντος','Αθήνα',81,18121,2105489623,37.983736,23.654999,350,b'1', b'1', NULL),
('dimitrisadamis1994@gmail.com','$2y$10$8sx5fL4K7tffDsaYrtnMVuXVmKeOw4KNcbM4jmlP/Ce8hPxgn2ZQW','Δημήτρης','Αδάμης','Φυλλής','Καματερό',230,13451,2105486723,38.082782,23.696269,700,b'1', b'1', NULL);

INSERT INTO `provider` (`ProvEmail`, `pwd`, `companyName`, `town`, `streetName`, `streetNumber`, `PostalCode`, `PhoneNumber`, `VAT`, `CompanyDescription`, `IBAN`, `online`, `activated`, `token`) VALUES
('KidsUp42+basket@gmail.com', '$2y$10$wZs.XXHE/vy2RMRBAKHlm.Vh/SoV13ABRm0Wbug36yJXTMVgMQ5xe', 'Γυμναστήρια Γκάλης', 'Ίλιον', 'Κωλέττη', 15, 13123, 2104532476, 4539841265, NULL, 6501245346, b'1', b'1', NULL),
('KidsUp42+dance@gmail.com', '$2y$10$yH1ifBEF0JBBz8RlYDijNuIdz/rlD/qIXhfAXCkCJnVi6OAzyAeVK', 'Το χορευτικό αρκούδι', 'Περιστέρι', 'Ποτίδαιας', 3, 12136, 2103056186, 375096439, NULL, 3879034173, b'1', b'1', NULL),
('KidsUp42+filoktitis@gmail.com', '$2y$10$PBruRbqBfaaCfzV/i1hIt.f9ls5KxeKUxXpl7kjWmBucA4yjQusCO', 'Φιλοκτήτης', 'Άγιοι Ανάργυροι', 'Παπανδρέου Γ.', 98, 13562, 2102312376, 145648962, NULL, 3957375632, b'1', b'1', NULL),
('KidsUp42+football@gmail.com', '$2y$10$O0JAxExS9lOChxcnnlISS.eRYMyPkwDK0V7uF56XdUdQKlnj8KLyG', 'Αθλητικός Όμιλος Βουλιαγμένης', 'Βουλιαγμένη', 'Αγίου Γεωργίου', 1, 16671, 2108906292, 564397123, NULL, 6509851243, b'1', b'1', NULL),
('KidsUp42+kolimvitiria@gmail.com', '$2y$10$HfJYiIBLHseJjk89yUFsYujA791POSMJfwUKUfz22SrKxtPzaOxmS', 'Κολυμβητήρια Α.Ε.', 'Ζωγράφου', 'ΚΑΝΕΛΛΟΠΟΥΛΟΥ ΚΟΚΚΙΝΟΠΟΥΛΟΥ', 5, 15773, 2107709854, 123487234, NULL, 5634861234, b'1', b'1', NULL),
('KidsUp42+nakas@gmail.com', '$2y$10$3M9KsXk11CW37g1Zv/9t8OVKMlaWkf3CcXlbQ2KB05ZSh0TEQ7n92', 'Ωδείο Φίλιππος Νάκας', 'Αιγάλεω', 'Ιερά Οδός', 240, 12242, 2105912770, 345123985, NULL, 3467129804, b'1', b'1', NULL),
('KidsUp42+party@gmail.com', '$2y$10$GuR2H7QLyjz91dOSJ9gTTeEkUe4/lihAp75V.D9zz3Wcwa636u1xK', 'Η χαρά του παιδιού', 'Δάφνη', 'Αρτέμωνος', 106, 17237, 2104532876, 865406264, NULL, 5467341276, b'1', b'1', NULL),
('KidsUp42+theater@gmail.com', '$2y$10$FfEslH4efKNyysDytWlTzOCei16Aky1gqHnVUAwQ/YP1BZxkkbc7a', 'Πέτρινο Θέατρο', 'Πετρούπολη', 'Ολυμπίας', 85, 13231, 2105167432, 341879352, NULL, 7693451852, b'1', b'1', NULL),
('tedroark7@gmail.com', '$2y$10$B9ms3AWhIfGWnU2aOR/YmeGf.U60UGwIW8AinqYWM204G9INS6hpC', 'MusicCompany', 'Καρπενήσι', 'Ζηνοπούλου', 42, 36100, 2237012345, 4242424242, NULL, 1234567891, b'1', b'1', NULL),
('tedroark7+1@gmail.com','$2y$10$Tr3KMFiLYr9V14xOr5R.Q.IkRuMx47QwoC6gbcclg11fDPXFMoucG','Ολυμπιακός','Πειραιάς','Κολοκοτρώνη',7,12221,2107777777,1458754329345821,'Η μεγαλύτερη ομάδα στην Ελλάδα. Προσφέρουμε δραστηριότητες σχετικές με ποδόσφαιρο και μπάσκετ.',3924678120485673,b'1',b'1',NULL),
('tedroark7+2@gmail.com','$2y$10$cP2h6wLb9zwgoYwSMAc8A.ZaSh/cErARNrI5bxLtJCJY43.nfg2FW','Παιδική Χαρά','Καλλιθέα','Δαβάκη',20,18344,2102995467,3876555908762323,'Παιδική χαρά για όλο το χρόνο.',5647472316876659,b'1',b'1',NULL),
('tedroark7+3@gmail.com','$2y$10$u9ymjN.lvfETMJA5tJYuIOFdo0jnIx5gmo/wvfKizuGLeoGcVQVhm','Κολυμβητικός Όμιλος Παλαιού Φαλήρου','Παλαιό Φάληρο','Φαλήρου',34,44576,2104596400,3465785432678965,NULL,4444567877776512,b'1',b'1',NULL);

INSERT INTO `activity` (`ActID`, `ProvEmail`, `actName`, `actType`, `actDate`, `price`, `MinAge`, `MaxAge`, `maxTickets`, `availableTickets`, `town`, `streetName`, `streetNumber`, `PostalCode`, `PhoneNumber`, `latitude`, `longitude`, `actDescription`, `pictureURL`, `visits`) VALUES
(1, 'KidsUp42+basket@gmail.com', 'Τουρνουά Μπάσκετ', 'Μπάσκετ', '2018-03-16 16:45:00', 50, 8, 16, 60, 60, 'Ίλιον', 'Κωλέττη', 15, 13123, 2104532476, '38.03231', '23.69825', 'Τελικός φιλικών αγώνων', '../uploads/basket3.jpg', 0),
(2, 'KidsUp42+basket@gmail.com', 'Μαθήματα Μπάσκετ', 'Μπάσκετ', '2018-02-06 13:45:00', 20, 6, 17, 100, 100, 'Κερατσίνι', 'Κοραή', 19, 18756, 2105468743, '37.96078', '23.61894', 'Μαθήματα Μπάσκετ', '../uploads/basket1.jpeg', 0),
(3, 'KidsUp42+basket@gmail.com', '3ο φιλικό τουρνουά μπάσκετ', 'Μπάσκετ', '2018-02-27 13:45:00', 30, 10, 12, 40, 40, 'Μοσχάτο', 'Πίνδου', 13, 18344, 2105645376, '37.94620', '23.67578', '3ο φιλικό τουρνουά μπάσκετ προεφήβων', '../uploads/basket2.jpg', 0),
(4, 'KidsUp42+basket@gmail.com', 'Παιδικά προκριματικά μπάσκετ', 'Μπάσκετ', '2018-04-24 13:45:00', 25, 6, 9, 24, 22, 'Καλλιθέα', 'Ξενοφώντος', 91, 17673, 2109875634, '37.94890', '23.69465', 'Προκριματικά για τελικό μπάσκετ', '../uploads/basket4.jpg', 2),
(5, 'KidsUp42+theater@gmail.com', 'Η Αλίκη στη χώρα των θαυμάτων', 'Θέατρο', '2018-02-27 18:00:00', 60, 4, 12, 80, 72, 'Αθήνα', 'Δημοχάρους', 55, 11521, 2106794564, '37.98239', '23.75171', 'Παιδικό Θέατρο', '../uploads/generic-fairytale.jpg', 3),
(6, 'KidsUp42+theater@gmail.com', 'Θέατρο σκιών', 'Θέατρο', '2018-01-03 19:30:00', 50, 6, 14, 70, 70, 'Νέα Φιλαδέλφεια', 'Κολοκοτρώνη', 14, 14342, 2105678765, '38.04574', '23.73497', 'Ο γάμος του Καραγκιόζη', '../uploads/καραγκιοζης.jpg', 0),
(7, 'KidsUp42+theater@gmail.com', 'Ο μάγος του Οζ', 'Θέατρο', '2018-03-29 20:00:00', 70, 6, 15, 120, 120, 'Αθήνα', 'Κερασούντος', 3, 11528, 2106794564, '37.98173', '23.75677', 'Το κλασσικό έργο με μοντέρνα ματιά.', '../uploads/wizofoz.jpg', 0),
(8, 'KidsUp42+dance@gmail.com', 'Μαθήματα Σάλσα', 'Χορός', '2018-02-02 14:45:00', 45, 7, 14, 20, 20, 'Αθήνα', 'Σκουφά', 25, 10673, 2106794564, '37.97841', '23.73964', 'Μαθήματα Σάλσα', '../uploads/salsa-dancing.jpg', 0),
(9, 'KidsUp42+dance@gmail.com', 'Μαθήματα Μπαλέτου', 'Χορός', '2018-02-25 19:45:00', 50, 5, 13, 30, 30, 'Αθήνα', 'Λυκαβηττού', 35, 10672, 2106794568, '37.98083', '23.73977', 'Μαθήματα Μπαλέτου απο διεθνώς αναγνωρισμένη καθηγήτρια.', '../uploads/balley-dancing.jpg', 0),
(10, 'KidsUp42+dance@gmail.com', 'Εκδήλωση latin χορών', 'Χορός', '2018-04-21 13:45:00', 50, 7, 15, 60, 60, 'Αθήνα', 'Αργολίδος', 2, 11523, 2106794345, '37.98890', '23.76349', 'Επίδειξη διαφόρων λατινοαμερικάνικων χορών.', '../uploads/dancing1.jpg', 0),
(11, 'KidsUp42+kolimvitiria@gmail.com', 'Μαθήματα κολύμβησης', 'Κολύμβηση', '2018-02-02 11:45:00', 60, 6, 12, 30, 30, 'Μεταμόρφωση', 'Διλόφου', 46, 14451, 2102824567, '38.05382', '23.75189', 'Μαθήματα κολύμβησης για μικρά παιδιά', '../uploads/swimming3.jpg', 0),
(12, 'KidsUp42+kolimvitiria@gmail.com', 'Προκριματικός αγώνας κολύμβησης', 'Κολύμβηση', '2018-03-03 13:45:00', 70, 6, 15, 50, 50, 'Καλλιθέα', 'Ναυάρχου Βότση', 18, 17674, 2109875000, '37.94237', '23.68984', 'Προκριματικός αγώνας', '../uploads/swimming1.jpg', 0),
(13, 'KidsUp42+filoktitis@gmail.com', 'Μαθήματα τοξοβολίας', 'Άλλο', '2018-04-14 00:00:00', 40, 10, 17, 25, 25, 'Άγιοι Ανάργυροι', 'Παπανδρέου Γ.', 98, 13562, 2102312376, '38.03550', '23.72839', 'Μαθήματα τοξοβολίας', '../uploads/allo.jpg', 0),
(14, 'KidsUp42+party@gmail.com', 'Παιδικά πάρτυ', 'Παιδικό Πάρτυ', '2018-03-04 14:00:00', 100, 6, 16, 70, 70, 'Πειραιάς', 'Ακτή Μουτσοπούλου', 8, 18535, 2106900770, '37.93913', '23.64779', 'Παιδικά Πάρτυ', '../uploads/party1.jpg', 0),
(15, 'tedroark7@gmail.com', 'Μαθήματα Κιθάρας', 'Μουσική', '2018-02-27 13:45:00', 15, 5, 18, 20, 20, 'Καρπενήσι', 'Ζηνοπούλου', 42, 36100, 2237012345, '38.91284', '21.79510', 'Μαθήματα Κιθάρας για παιδιά!!!', '../uploads/7.jpg', 0),
(16, 'tedroark7@gmail.com', 'Βιολί', 'Μουσική', '2018-02-27 14:30:00', 20, 5, 17, 50, 50, 'Καρπενήσι', 'Μπακογιάννη', 7, 36100, 2237023145, '38.91418', '21.79035', 'Μαθήματα Βιολιού για παιδιά !!!', '../uploads/violin.jpg', 0),
(17, 'tedroark7@gmail.com', 'Μαθήματα Ντραμς', 'Μουσική', '2018-02-27 15:45:00', 10, 4, 16, 50, 50, 'Καρπενήσι', 'Κονδύλη', 5, 36100, 2237013245, '38.91371', '21.79314', 'Μαθήματα ντραμς για παιδιά :)!!!', '../uploads/drums.jpg', 0),
(18, 'tedroark7@gmail.com', 'Σαξόφωνο', 'Μουσική', '2018-03-10 16:45:00', 20, 8, 18, 25, 25, 'Λαμία', 'Λεωνίδου', 47, 32500, 2314214567, '38.89831', '22.43738', 'Σαξόφωνο για παιδιά, περιορισμένη διαθεσιμότητα προλάβετε !!!', '../uploads/sax.jpg', 0),
(19, 'tedroark7+1@gmail.com','Παιδική Χαρά','Γενικού Τύπου','2018-01-25 17:00:00',50,2,10,30,30,'Κηφισιά','Μυρσίνης',5,14561,2104523870,38.077324,23.815600,'Παιδική Χαρά με κλόουν και ομαδικά παιχνίδια για μικρά και μεγάλα παιδιά','../uploads/playground.jpeg',0),
(20, 'tedroark7+1@gmail.com','Μαθαίνω να οδηγώ','Γενικού Τύπου','2018-04-20 11:00:00',100,5,10,30,30,'Ταύρος','Παναγή Τσαλδάρη',15,17778,2104444444,37.96522,23.70496,'Μια πρώτη επαφή των παιδιών με τους κανόνες της κυκλοφοριακής αγωγής.','../uploads/driving.jpeg',0),
(21, 'tedroark7+1@gmail.com','Μαθαίνω να κολυμπώ','Κολύμβηση','2018-04-15 12:00:00',100,5,13,50,50,'Παλαιό Φάληρο','Αρτέμιδος',34,17561,2104596400,37.930773,23.692743,'Εκδήλωση όπου έμπειροι παιδαγωγοί μαθαίνουν τα παιδιά να κολυμπούν','../uploads/swimm.jpeg',10),
(22, 'tedroark7+2@gmail.com','Τα μυστικά του ποδοσφαίρου','Ποδόσφαιρο','2018-02-27 18:00:00',150,10,16,70,70,'Παλαιό Φάληρο','Δράκου',3,17561,2104596403,37.964924,23.726470,'Συμβουλές προς τα παιδιά από παλαίμαχους ποδοσφαιριστές για τα μυστικά του ποδοσφαίρου και μύηση στο ευ αγωνίζεσθαι.','../uploads/football_adv.jpeg',50),
(23, 'tedroark7+2@gmail.com','εφηβικό τουρνουά ποδοσφαίρου','Ποδόσφαιρο','2018-08-07 22:00:00',150,5,15,250,250,'Πειραιάς','Καραολή και Δημητρίου και Σοφιανοπούλου',7,18547,2107777777,37.9483,23.6642,'ποδοσφαιρικοί αγώνες','../uploads/tournament.jpeg',0),
(24, 'tedroark7+3@gmail.com','πάρτυ με κλόουν','Γενικού Τύπου','2018-10-21 11:00:00',15,3,12,30,30,'Γέρακας','Μιαούλη',18,15344,2103546782,38.0123,23.8461,'ψυχαγωγικές δραστηριότητες με την παρουσία κλόουν','../uploads/party.jpeg',0),
(25, 'tedroark7+3@gmail.com','Μαθήματα Κολύμβησης για Νήπια','Κολύμβηση','2018-05-20 12:00:00',50,1,3,50,50,'Πειραιάς','Πραξιτέλους',30,18547,2104762891,37.946776,23.652594,'Μία πρώτη επαφή και προσπάθεια εξοικείωσης των μικρών παιδιών με το νερό.','../uploads/swimm_baby_lessons.jpeg',0);

INSERT INTO `sell` (`SellID`, `ParEmail`, `ActID`, `SellDate`, `numberofTickets`, `totalCost`) VALUES
(1, 'KidsUp42+mariapapa@gmail.com', 4, '2018-02-25 03:41:58', 2, 50),
(2, 'KidsUp42+pantelism@gmail.com', 5, '2018-02-25 03:48:26', 4, 240),
(3, 'KidsUp42+pantelism@gmail.com', 5, '2018-02-25 03:48:32', 4, 240);

exit